tap "d12frosted/emacs-plus"
tap "daviderestivo/emacs-head"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "laishulu/cask-fonts"
tap "osx-cross/avr"
tap "railwaycat/emacsmacport"
tap "schniz/tap"
tap "srkomodo/tap"
brew "arduino-cli"
brew "automake"
brew "coreutils"
brew "readline"
brew "asdf"
brew "aspell"
brew "python@3.9"
brew "glib"
brew "python@3.8"
brew "autojump"
brew "bat"
brew "bear"
brew "icu4c"
brew "node"
brew "bitwarden-cli"
brew "boost"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "editorconfig"
brew "eg-examples"
brew "fasd"
brew "fd"
brew "pkg-config"
brew "harfbuzz"
brew "libass"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghc@8.8"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gnu-getopt"
brew "gnuplot"
brew "go"
brew "openjdk"
brew "gradle"
brew "gtk+3"
brew "haskell-stack"
brew "hyperfine"
brew "icdiff"
brew "imagemagick"
brew "isync"
brew "lastpass-cli"
brew "libvterm"
brew "llvm"
brew "luarocks"
brew "make"
brew "mask"
brew "midnight-commander"
brew "mono"
brew "mu"
brew "mysql"
brew "ncdu"
brew "neovim", args: ["HEAD"]
brew "netcat"
brew "openconnect"
brew "pandoc"
brew "pipenv"
brew "pngpaste"
brew "poppler"
brew "portmidi"
brew "pyenv"
brew "pygobject3"
brew "qemu"
brew "ranger"
brew "ripgrep"
brew "rustc-completion"
brew "rustup-init"
brew "sbcl"
brew "sdcv"
brew "sdl"
brew "sdl_image"
brew "sdl_mixer"
brew "sdl_ttf"
brew "shellcheck"
brew "subversion"
brew "swiftlint"
brew "taglib"
brew "tectonic"
brew "telnet"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tofrodos"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh-completions"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-modern-pen-icon", "without-imagemagick"], link: false
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-modern-pen-icon", "without-imagemagick"], link: false
brew "daviderestivo/emacs-head/emacs-head@27", args: ["HEAD", "with-cocoa", "with-modern-icon-purple", "with-xwidgets", "without-harfbuzz", "without-imagemagick@7"]
brew "osx-cross/avr/avr-gcc"
brew "srkomodo/tap/shadowfox-updater"
cask "adoptopenjdk"
cask "aegisub"
cask "alacritty"
cask "amethyst"
cask "android-platform-tools"
cask "balenaetcher"
cask "bitwarden"
cask "chromium"
cask "cyberduck"
cask "daisydisk"
cask "deadbolt"
cask "deluge"
cask "docker"
cask "dozer"
cask "dropbox"
cask "emacs-mac"
cask "firefox"
cask "font-b612-mono"
cask "font-charm"
cask "font-cormorant-garamond"
cask "font-fira-code-nerd-font"
cask "font-glow-sans-j-normal"
cask "font-glow-sans-sc-normal"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-libre-baskerville"
cask "font-meslo-lg-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-sans"
cask "font-noto-sans-cjk"
cask "font-noto-serif"
cask "font-noto-serif-cjk"
cask "font-overpass"
cask "font-overpass-mono"
cask "font-overpass-nerd-font"
cask "font-proza-libre"
cask "font-sarasa-nerd"
cask "font-source-code-pro"
cask "font-source-han-sans"
cask "font-source-han-serif"
cask "font-twitter-color-emoji"
cask "font-ubuntu"
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"
cask "fontforge"
cask "hex-fiend"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "kawa"
cask "keycastr"
cask "kitty"
cask "mactex"
cask "mkvtoolnix"
cask "mos"
cask "mounty"
cask "notion"
cask "obs"
cask "powershell"
cask "qlstephen"
cask "qlvideo"
cask "skim"
cask "slack"
cask "sourcetree"
cask "swiftformat-for-xcode"
cask "swimat"
cask "textmate"
cask "tor-browser"
cask "typora"
cask "v2rayx"
cask "vanilla"
cask "vimr"
cask "vlc"
cask "vmware-fusion"
